app/views/subcategories/_form.html.erb


<%= f.collection_select :categorie_id, Category.all, :id, :name ,{:prompt=> 'Select Category'} %>
---
SELECT `categories`.* FROM `categories`