app/controllers/categories_controller.rb

  def index
    @categories = Category.all
@categories = Category.paginate(:page => params[:page],:per_page => 2)
---
SELECT `categories`.* FROM `categories`
SELECT COUNT(*) FROM `categories`
SELECT `categories`.* FROM `categories` LIMIT 2 OFFSET 0

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO `categories` (`name`, `description`, `created_at`, `updated_at`) VALUES ('category1', '', '2011-09-08 12:43:52', '2011-09-08 12:43:52')