app/controllers/products_controller.rb

INSERT INTO `products` (`productname`, `price`, `weight`, `category_id`, `subcategory_id`, `created_at`, `updated_at`, `file_file_name`, `file_content_type`, `file_file_size`, `file_updated_at`, `avatar_file_name`, `avatar_content_type`, `avatar_file_size`, `avatar_updated_at`) VALUES ('product', NULL, NULL, '1', '', '2011-09-08 14:08:19', '2011-09-08 14:08:19', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL)
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save