app/controllers/subcategories_controller.rb

SELECT `subcategories`.* FROM `subcategories`
---
  def index
    @subcategories = Subcategory.all

SELECT id,name FROM `subcategories` WHERE `subcategories`.`category_id` = 2
---
 def load_subcategories
   if request.xhr?
    @subcategories = Subcategory.select('id,name').where(:category_id =>params[:id].to_i)

SELECT `subcategories`.* FROM `subcategories` WHERE `subcategories`.`id` = 1 LIMIT 1
---
  def show
    @subcategory = Subcategory.find(params[:id])

INSERT INTO `subcategories` (`name`, `description`, `categorie_id`, `created_at`, `updated_at`) VALUES ('asdfasdfa', 'sdfasdf', 1, '2011-09-08 12:47:25', '2011-09-08 12:47:25')
---
  def create
    @subcategory = Subcategory.new(params[:subcategory])

    respond_to do |format|
      if @subcategory.save